Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.Revision.FileName Property
 Gets the revision file name.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string FileName {
	get;
 }
Public ReadOnly Property FileName As String
		Get
Property Value
Type: String
 The revision file name.
See Also
Reference
ReferenceModel.Revision Structure
Tekla.Structures.Model Namespace